# 3. Задайте список из n чисел последовательности (1+ 1/n)^n
# и выведите на экран их сумму (округляйте до 3 знаков после запятой).
# Пример:
# - Для n = 6: [2, 2.25, 2.37, 2.441, 2.488, 2.522]
# Вывод: 14.031 (2 + 2.25 + 2.37 + 2.441 + 2.448 + 2.522)

num = 0
sum = 0
list = []
N = int(input('введите число N: '))
for i in range(1, N+1):
    num = (1 + 1 / i)**i
    numround = round(num, 3)
    sum = sum + numround
    list.append(numround)
print(list)
print(f'Вывод: {sum}')